Revit 2027 API
BrowserOrganization.GetCurrentBrowserOrganizationForSchedules Method
 Gets the BrowserOrganization that applies to the Schedules section of the project browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BrowserOrganization GetCurrentBrowserOrganizationForSchedules(
	Document document
)
Public Shared Function GetCurrentBrowserOrganizationForSchedules (
	document As Document
) As BrowserOrganization
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForSchedules(
	Document^ document
)
static member GetCurrentBrowserOrganizationForSchedules :
        document : Document -> BrowserOrganization
Parameters
document Document
 Revit document from which to get the organization data.
Return Value
BrowserOrganization
 The BrowserOrganization for schedules, or null if no schedules sections exist
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace